Repository: aleksandr-mor/Qwifty
Catalog: Qwifty/Localization/*.lproj/Localizable.strings
Languages: de

source: What is the default data type for floating point numbers in Swift?
de: Was ist der Standard-Datentyp für Fließkommazahlen in Swift?

source: What keyword is used to declare a constant in Swift?
de: Welches Schlüsselwort wird verwendet, um eine Konstante in Swift zu deklarieren?

source: How to write a multiple line comment in Swift?
de: Wie schreibt man einen mehrzeiligen Kommentar in Swift?

source: How are Structs different from Classes in Swift?
de: Wie unterscheiden sich Strukturen von Klassen in Swift?

source: Structures are value types
de: Strukturen sind Werttypen

source: Structures are reference types
de: Strukturen sind Referenztypen

source: Structures support inheritance
de: Strukturen unterstützen Vererbung

source: Structures don’t receive a default initializer
de: Strukturen erhalten keinen Standardinitialisierer

source: Name the properties whose initial values are not calculated until the first use
de: Benennen Sie die Eigenschaften, deren Anfangswerte erst bei der ersten Verwendung berechnet werden

source: Computed Properties
de: Berechnete Eigenschaften

source: Delayed Properties
de: Verzögerte Eigenschaften

source: Stored Properties
de: Gespeicherte Eigenschaften

source: Lazy Stored Properties
de: Faule gespeicherte Eigenschaften

source: What is the significance of “?” in Swift?
de: Was bedeutet das “?” in Swift?

source: It is used to force unwrap the variable
de: Es wird verwendet, um die Variable zwangsweise zu entpacken

source: It makes a property optional
de: Es macht eine Eigenschaft optional

source: It returns first none nil value
de: Es gibt zunächst keinen Nullwert zurück

source: It is used to replace the external label
de: Es gibt zunächst keinen Nullwert zurück

source: Choose the correct statement
de: Wählen Sie die richtige Aussage

source: Bounds are in a view’s own coordinate system
de: Grenzen sind im eigenen Koordinatensystem einer View

source: Frame is in the superview’s coordinate system
de: Der Rahmen befindet sich im Koordinatensystem der Superview

source: Both statements are correct
de: Beide Aussagen sind richtig

source: Both statements are incorrect
de: Beide Aussagen sind falsch

source: Name a protocol that allows us to convert Swift types to and from JSON
de: Nennen Sie ein Protokoll, mit dem wir Swift-Typen in JSON und aus JSON konvertieren können

source: A function inside a function is called…
de: Eine Funktion innerhalb einer Funktion nennt man eine...

source: Nested Function
de: Verschachtelte Funktion

source: Super Function
de: Superfunktion

source: Base Function
de: Basisfunktion

source: Encapsulation
de: Verkapselung

source: Constant and variable names in Swift can't contain…
de: Konstanten- und Variablennamen in Swift können nicht enthalten...

source: Numbers
de: Zahlen

source: Capital letters
de: Großbuchstaben

source: Spaces
de: Leerzeichen

source: What keyword is used to declare a variable in Swift?
de: Welches Schlüsselwort wird verwendet, um eine Variable in Swift zu deklarieren?

source: No keyword required
de: Kein Schlüsselwort erforderlich

source: Swift consists of the following Control transfer statements, except for:
de: Swift besteht aus den folgenden Kontrollübertragungsanweisungen, mit Ausnahme der folgenden:

source: What is PLIST?
de: Was ist PLIST?

source: What is “??” in Swift?
de: Was ist “??” in Swift?

source: Binary operator
de: Binärer Operator

source: Logical OR operator
de: Logischer OR-Operator

source: Nil-coalescing operator
de: Nil-Koaleszenz-Operator

source: What is the logical “AND” operator in Swift?
de: Was ist der logische Operator “AND” in Swift?

source: What is wrong with this code? let num = 1.0 + 1
de: Was ist an diesem Code falsch? let num = 1.0 + 1

source: There is nothing wrong
de: Es ist alles in Ordnung

source: There is no semicolon
de: Es gibt kein Semikolon

source: num is constant and can’t be changed
de: num ist konstant und kann nicht verändert werden

source: 1.0 and 1 are different types
de: 1.0 und 1 sind unterschiedliche Typen

source: What can AnyObject represent?
de: Was kann AnyObject darstellen?

source: An instance of any class
de: Eine Instanz einer beliebigen Klasse

source: An instance of function type
de: Eine Instanz des Funktionstyps

source: An instance of an optional type
de: Eine Instanz eines optionalen Typs

source: All answers are correct
de: Alle Antworten sind richtig

source: What is LLVM?
de: Was ist LLVM?

source: Contains both compilers
de: Enthält beide Compiler

source: None of the above
de: Nichts von alledem

source: What is data type of nums? let nums = (“num”, 0)
de: Was ist der Datentyp von nums? let nums = (“num”, 0)

source: Dictionary
de: Wörterbuch

source: Tuple
de: Tupel

source: All answers are incorrect
de: Alle Antworten sind falsch

source: How many times will this loop be executed? for i in 0…100 { print(i) }
de: Wie viele Male wird diese Schleife ausgeführt? for i in 0…100 { print(i) }

source: How would you call a function that returns a value and also throws errors?
de: Wie würde man eine Funktion aufrufen, die einen Wert zurückgibt und auch Fehler auslöst?

source: didSet and willSet are…
de: didSet und willSet sind...

source: Property Observers
de: Eigenschaft Beobachter

source: Instance Methods
de: Instanzmethoden

source: Lifecycle Methods
de: Lebenszyklusmethoden

source: When a function takes a closure as a parameter, when should you mark it as an escaping?
de: Wenn eine Funktion eine Schließung als Parameter annimmt, wann sollte man sie als Escaping markieren?

source: When it’s lazy loaded
de: Wenn es faul geladen ist

source: When it’s scope is undefined
de: Wenn der Geltungsbereich unbestimmt ist

source: When it’s executed after function returns
de: Wenn es nach der Rückkehr der Funktion ausgeführt wird

source: When it executed before function returns
de: Wenn sie vor der Rückkehr der Funktion ausgeführt wird

source: What are the collection types in Swift?
de: Was sind die Auflistungstypen in Swift?

source: Dictionary and library
de: Wörterbuch und Bibliothek

source: Array and library
de: Array und Bibliothek

source: Library, dictionary and array
de: Bibliothek, Wörterbuch und Array

source: Dictionary, array and set
de: Wörterbuch, Array und Set

source: Swift is…
de: Swift ist...

source: Scripting language
de: Skriptsprache

source: Object-oriented language
de: Objektorientierte Sprache

source: Type safe language
de: Typsichere Sprache

source: What are the common execution states in iOS?
de: Was sind die üblichen Ausführungszustände in iOS?

source: Not running
de: Nicht rennen

source: Inactive
de: Inaktiv

source: Active
de: Aktiv

source: All of the above
de: Alle oben genannten

source: What statement can be used to stop the execution of a loop, if, or switch statement?
de: Welche Anweisung kann verwendet werden, um die Ausführung einer loop-, if- oder switch-Anweisung zu beenden?

source: iOS was originally an acronym for…
de: iOS war ursprünglich ein Akronym für...

source: The IDE used in Swift is…
de: Die in Swift verwendete IDE ist...

source: Double has a precision of at least … decimal digits in Swift
de: Double hat eine Genauigkeit von mindestens ... Dezimalstellen in Swift

source: Name the incorrect data type in Swift
de: Benennen Sie den falschen Datentyp in Swift

source: If you don’t want to mention external name in function call, you can use…
de: Wenn Sie den externen Namen im Funktionsaufruf nicht erwähnen wollen, können Sie ... verwenden.

source: Name the incorrect value type in Swift
de: Benennen Sie den falschen Wertetyp in Swift

source: Which of the following frameworks is not used in iOS?
de: Welches der folgenden Frameworks wird in iOS nicht verwendet?

source: Which of the following declares an immutable array in Swift?
de: Welche der folgenden Möglichkeiten deklariert ein unveränderliches Array in Swift?

source: What is the current status of the App if it is running in the background but not receiving any events?
de: Was ist der aktuelle Status der App, wenn sie im Hintergrund läuft, aber keine Ereignisse empfängt?

source: What is Bundle in iOS?
de: Was ist Bundle in iOS?

source: It is used to send data
de: Es wird verwendet, um Daten zu senden

source: Class
de: Klasse

source: Folder with .app extension
de: Ordner mit .app-Erweiterung

source: Which symbol can be used to separate digits in numeric literals?
de: Welches Symbol kann verwendet werden, um Ziffern in numerischen Literalen zu trennen?

source: The supported architecture for round, ceil and floor is/are…
de: Die unterstützte Architektur für round, ceil und floor ist/sind...

source: Both 32 and 64 bit
de: 32 und 64 Bit

source: Which statements evaluates to true while checking the equal strings in Swift?
de: Welche Anweisungen werden bei der Überprüfung der gleichen Zeichenketten in Swift als true ausgewertet?

source: Which method is used to check for prefix in Swift?
de: Welche Methode wird verwendet, um in Swift nach Präfixen zu suchen?

source: How to convert a String to uppercase in Swift?
de: Wie konvertiert man in Swift einen String in Großbuchstaben?

source: Which operator is used to negate a Bool in Swift?
de: Welcher Operator wird verwendet, um ein Bool in Swift zu negieren?

source: Which type are arrays in Swift?
de: Welcher Typ sind Arrays in Swift?

source: Reference
de: Referenz

source: Value
de: Wert

source: Object
de: Objekt

source: Immutable
de: Unveränderlich

source: Which of the following are supported by Swift?
de: Welche der folgenden Optionen werden von Swift unterstützt?

source: Arrays with repeated values
de: Arrays mit wiederholten Werten

source: Empty arrays
de: Leere Arrays

source: Multi-dimensional arrays
de: Mehrdimensionale Arrays

source: Which method is used to extract values of a given type from an array?
de: Welche Methode wird verwendet, um Werte eines bestimmten Typs aus einem Array zu extrahieren?

source: How to filter out nil from an array?
de: Wie filtert man nil aus einem Array heraus?

source: Which is the feature of tuple in Swift?
de: Welches ist die Funktion von Tupel in Swift?

source: Tuples can be decomposed into variables
de: Tupel können in Variablen zerlegt werden

source: The values within a tuple can be of any type
de: Die Werte innerhalb eines Tupels können von beliebigem Typ sein

source: It's a comma-separated list of types
de: Es ist eine kommagetrennte Liste von Typen

source: How to swap a and b in Swift? var a = 0 var b = 1
de: Wie vertauscht man a und b in Swift? var a = 0 var b = 1

source: How to reverse a String in Swift?
de: Wie kehrt man einen String in Swift um?

source: How to declare an Iboutlet property?
de: Wie deklariert man eine Iboutlet-Eigenschaft?

source: Name the control transfer statement in Swift?
de: Wie lautet die Anweisung zur Kontrollübergabe in Swift?

source: What are the advantages of Swift?
de: Was sind die Vorteile von Swift?

source: It’s safe
de: Es ist sicher

source: It’s fast
de: Es ist schnell

source: It’s opensource
de: Es ist Open Source

source: What type of integer is denoted by “Int8“?
de: Welcher Typ von Ganzzahl wird mit “Int8“ bezeichnet?

source: What will be printed in the console? var greeting = “Hello World!“ greeting = nil?
de: Was wird in der Konsole ausgedruckt? var greeting = “Hello World!“ greeting = nil?

source: The compiler won’t allow it
de: Der Compiler lässt es nicht zu

source: What is super class of AppDelegate?
de: Was ist die Superklasse von AppDelegate?

source: What access control modifier restricts the use of an entity within the same defined source file?
de: Welcher Zugriffskontrollmodifikator schränkt die Verwendung einer Entität innerhalb der gleichen definierten Quelldatei ein?

source: What is default access control level in Swift?
de: Was ist die Standard-Zugriffskontrollebene in Swift?

source: A function that can change any property in its enclosing value is called...
de: Eine Funktion, die eine beliebige Eigenschaft in ihrem umschließenden Wert ändern kann, heißt...

source: Which of these is a protocol?
de: Was davon ist ein Protokoll?

source: ! (not) is an example of
de: ! (nicht) ist ein Beispiel für

source: function
de: Funktion

source: closure
de: Schließung

source: conditional
de: Bedingt

source: logical operator
de: logischer Operator

source: && (and) is an example of
de: && (und) ist ein Beispiel für

source: What is the best classification for the identifier “stringOfNumbers“?
de: Was ist die beste Klassifizierung für den Bezeichner “stringOfNumbers“?

source: identifier written in camel case
de: Bezeichner geschrieben in camel case

source: conditional statement
de: bedingte Aussage

source: identifier with a string data type
de: Bezeichner mit einem String-Datentyp

source: function's name
de: Name der Funktion

source: Identify the assignment operator
de: Identifizieren Sie den Zuweisungsoperator

source: if, else if, else statements are classified as
de: if, else if, else-Anweisungen werden klassifiziert als

source: loops
de: Schleifen

source: conditionals
de: Konditionale

source: constants
de: Konstanten

source: variables
de: Variablen

source: Which of the following is executed when the condition in an if statement is false?
de: Welche der folgenden Aufgaben wird ausgeführt, wenn die Bedingung in einer if-Anweisung false ist?

source: Check if a is not equal to 100 or b is less than 200
de: Prüfen, ob a ungleich 100 ist oder b kleiner als 200 ist

source: Name the value that can only be either true or false?
de: Nennen Sie den Wert, der nur entweder true oder false sein kann?

source: What is the correct way to call the function below: func rickAstley() { print(“Never Gonna Give You Up“) }
de: Wie kann man die folgende Funktion korrekt aufrufen?: func rickAstley() { print(“Never Gonna Give You Up“) }

source: What is the question mark (?) in Swift used for?
de: Wofür wird das Fragezeichen (?) in Swift verwendet?

source: Used in parameter declaration
de: Wird in der Parameterdeklaration verwendet

source: Used in loop declaration
de: Wird in der Schleifendeklaration verwendet

source: Used in function declaration
de: Wird in der Funktionsdeklaration verwendet

source: Used in property declaration
de: Wird in der Eigenschaftserklärung verwendet

source: Define operator a..<b
de: Definieren Sie den Operator a..<b

source: Half-closed range
de: Halbgeschlossener Bereich

source: Half-open range
de: Halboffener Bereich

source: Full-closed range
de: Vollständig geschlossener Bereich

source: Full-open range
de: Vollständig geöffneter Bereich

source: Define operator a...
de: Definieren Sie Operator a...

source: One-sided range
de: Einseitiger Bereich

source: Left-sided range
de: Linksseitiger Bereich

source: Start a new game!
de: Beginnen Sie ein neues Spiel!

source: Current progress won't be saved
de: Aktueller Fortschritt wird nicht gespeichert

source: Cancel
de: Abbrechen
